      *> Sample GnuCOBOL program
       identification division.
       program-id. hellonew.
       procedure division.
           display 'Hello '' World'.
       stop run.